posts/vivendo-no-emacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>[[file:../index.html][Vivendo no Emacs]]</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="../src/styles.css " />
<link rel="stylesheet" href="../src/colors.css " />
</head>
<body>
<div id="content" class="content">
<h1 class="title"><a href="../index.html">Vivendo no Emacs</a></h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc652a11">Como assim?</a></li>
<li><a href="#orge8fdbc5">E como está agora?</a></li>
<li><a href="#org7008c69">O que tem nela?</a></li>
<li><a href="#orgb2240b0">Sem Evil-mode</a></li>
<li><a href="#orgc702258"><i>Fin</i></a></li>
</ul>
</div>
</div>
<p>
Sim. Eu enlouqueci.
</p>

<div id="outline-container-orgc652a11" class="outline-2">
<h2 id="orgc652a11">Como assim?</h2>
<div class="outline-text-2" id="text-orgc652a11">
<p>
Bom, recentemente eu voltei a mexer no Emacs, eu já tinha feito isso a um tempo atrás, numa era sombria em que eu tinha uma conta no reddit.
</p>

<p>
<b>Senhor, tenha piedade de minha alma.</b>
</p>

<p>
Enfim, aquela configuração do Emacs foi a minha primeira experiência com ele, só que ela era… Digamos que não era lá muito boa.
</p>

<p>
Eu tava tentando fazer a minha própria versão do <a href="https://github.com/doomemacs/doomemacs">Doomemacs</a>, o que já vou adiantando:
É uma péssima idéia pra quem tá começando. Não é muito diferente de você ser novo em desenvolvimento de jogos e já querer fazer um The Last Of Us: Parte 69.
Vai dar merda, é só você que não percebeu ainda.
</p>
</div>
</div>

<div id="outline-container-orge8fdbc5" class="outline-2">
<h2 id="orge8fdbc5">E como está agora?</h2>
<div class="outline-text-2" id="text-orge8fdbc5">
<p>
<b>MUITO</b> melhor. A primeira coisa que eu devo falar sobre a minha configuração é que, em comparação com a minha primeira vez, ela é muito mais estável, agradável de usar, rápida para iniciar e flexível. A configuração antiga parece uma gambiarra feita com fita isolante comparada à atual.
</p>
</div>
</div>

<div id="outline-container-org7008c69" class="outline-2">
<h2 id="org7008c69">O que tem nela?</h2>
<div class="outline-text-2" id="text-org7008c69">
<p>
Rapaz, eu configurei até que bastante coisa, várias teclas de atalho, pacotes, etc. Mas só pra listar, eu configurei:
</p>

<ul class="org-ul">
<li>Um cliente de Email</li>
<li>Um cliente de mpd</li>
<li>Um cliente de irc</li>
<li>Um leitor rss</li>
<li>Um modo de apresentação de slides</li>
<li>Um leitor de pdf</li>
<li>Uma dashboard</li>
</ul>

<p>
Claro que tem mais coisa, como por exemplo as configurações da aparência, mas isso não é o mais interessante, o que realmente é interessante é…
</p>
</div>
</div>

<div id="outline-container-orgb2240b0" class="outline-2">
<h2 id="orgb2240b0">Sem Evil-mode</h2>
<div class="outline-text-2" id="text-orgb2240b0">
<p>
Isso sim é algo que poucos esperam, um Emacs, configurado, sem o Evil. Fiz isso porque eu quero aprender a usar o Emacs, não recriar o Vim, que foi +/- também o que fiz no passado. Estou aprendendo as teclas de atalho padrão do Emacs, e também tô fazendo as minhas próprias, e apesar de ser algo diferente do que eu estou acostumado, a experiência de usar o Emacs está sendo muito agradável.
</p>

<p>
A maior parte dos erros na minha configuração foram causados por erros de digitação, não porque um plugin X entrou em conflito com plugin Y ou porque uma tecla de atalho que eu configurei entra em conflito com uma tecla de atalho usada por um plugin que usa ela por algum motivo que só Deus sabe.
</p>

<p>
Não tô dizendo que isso é algo que aconteceu comigo enquanto eu usei o Vim, não, isso foi o que acontecia comigo na minha primeira configuração do Emacs. É, eu disse que aqueles eram tempos sombrios.
</p>
</div>
</div>

<div id="outline-container-orgc702258" class="outline-2">
<h2 id="orgc702258"><i>Fin</i></h2>
<div class="outline-text-2" id="text-orgc702258">
<p>
Bem, é isso. Não vou ficar de papo sobre como o Org-mode é a 9ª maravilha do mundo nem nada do gênero, isso já foi dinfundido por cada ser que usa o Emacs no planeta, e eu não preciso ser mais um fazendo isso.
</p>

<p>
Até o próximo post!
</p>
</div>
</div>
</div>
</body>
</html>